In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from scipy import stats
import seaborn as sb

In [2]:
telco_df = pd.read_csv('telco.txt', sep='\t')
telco_df.head()

,tenure,age,marital,address,income,ed,employ,retire,gender,longmon,wiremon,churn
1,13,44,Married,9,64,College degree,5,No,Male,3.70,0.0,Yes
2,11,33,Married,7,136,Post-undergraduate degree,5,No,Male,4.40,35.7,Yes
3,68,52,Married,24,116,Did not complete high school,29,No,Female,18.15,0.0,No
4,33,33,Unmarried,12,33,High school degree,0,No,Female,9.45,0.0,Yes
5,23,30,Married,9,30,Did not complete high school,2,No,Male,6.30,0.0,No

# Problem 4

## Task 1
Description: Have a closer look at the deÔ¨Ånitions of the variables and analyze which of them might require a separate treatment. Consider for example the variable ed. There are two possibilities how the variable ed can be included into the model (one with dummy variables, the other one without dummies). Think about these two approaches and suggest which approach is more appropriate. Motivate your decision.

In given dataset the are multiple categorical variables such as:
- marital with values Married and Unmarried;
- retire with Yes and No values;
- gender with Male and Female values;
- churn with values Yes and No;
- ed with 5 distinct values - Did not complete high school, High school degree, Some college, College degree, Post-undergraduate degree.

Most common ways of including such variables into model are Dummy Variable Encoding and Label Encoding. Dummy Variable Encoding introduces $m-1$ dummy variables (with values 1 or 0 only) for each categorical variable with $m$ posible categories. It is important to introduce exqactly $m-1$ variables and not $m$ dummy variables because last category will be represented as 0 values for all other $m-1$ categories. Such category called reference category.

In our case, for variables marital, retire, gender and churn we need to introduce one dummy variabe per each of them. It is possible because all those variables are binary variables which taks either one values or another and there is no overlay between values possible. For variable ed we need to introduce 4 dummy variables for categories Did not complete high school, High school degree, Some college and College degree respectively. Category Post-undergraduate degree will be reference one and represented by this 4 dummy variables when all of them are equal to 0.

Another way to introduce ategorical variables into model is Label Encoding. With this approach for each categorical variable we introduce one new variable with respective numeric labels per category. So that, for variables marital, retire, gender and churn we will introduce label variables for each with values 1 and 2. Simillary, for variable ed we will introduce one new label variable with values from 1 to 5 representing existing categories.

Below are transformed datasets using both approaches.

In [15]:
#Dummy Variable Encoding 

telco_dummy_df = pd.get_dummies(telco_df, columns=(['marital', 'retire', 'gender', 'churn', 'ed']))
# test.

telco_dummy_df.head()

,tenure,age,address,income,employ,longmon,wiremon,marital_Married,marital_Unmarried,retire_No,retire_Yes,gender_Female,gender_Male,churn_No,churn_Yes,ed_College degree,ed_Did not complete high school,ed_High school degree,ed_Post-undergraduate degree,ed_Some college
1,13,44,9,64,5,3.70,0.0,1,0,1,0,0,1,0,1,1,0,0,0,0
2,11,33,7,136,5,4.40,35.7,1,0,1,0,0,1,0,1,0,0,0,1,0
3,68,52,24,116,29,18.15,0.0,1,0,1,0,1,0,1,0,0,1,0,0,0
4,33,33,12,33,0,9.45,0.0,0,1,1,0,1,0,0,1,0,0,1,0,0
5,23,30,9,30,2,6.30,0.0,1,0,1,0,0,1,1,0,0,1,0,0,0